-- phpMyAdmin SQL Dump
-- version 4.6.5.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2017-06-26 16:42:49
-- 服务器版本： 10.1.21-MariaDB
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `management`
--

-- --------------------------------------------------------

--
-- 表的结构 `admin_core`
--

CREATE TABLE `admin_core` (
  `id` int(4) NOT NULL COMMENT '管理员编码',
  `password` varchar(50) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `statement` int(10) DEFAULT NULL COMMENT '0 超级管理员，1招生人员'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `admin_core`
--

INSERT INTO `admin_core` (`id`, `password`, `name`, `statement`) VALUES
(1000, '14e1b600b1fd579f47433b88e8d85291', '简敏勇', 0),
(1001, '14e1b600b1fd579f47433b88e8d85291', '招生人员', 1);

-- --------------------------------------------------------

--
-- 表的结构 `exam`
--

CREATE TABLE `exam` (
  `id` int(8) NOT NULL COMMENT '考试编号',
  `subject` varchar(50) DEFAULT NULL COMMENT '科目',
  `start_time` varchar(50) DEFAULT NULL COMMENT '起始时间',
  `deadline` varchar(50) DEFAULT NULL COMMENT '终止时间',
  `location` varchar(200) DEFAULT NULL COMMENT '地点',
  `capacity` int(8) DEFAULT NULL COMMENT '人数容量',
  `number` int(8) DEFAULT NULL COMMENT '已选人数'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `exam`
--

INSERT INTO `exam` (`id`, `subject`, `start_time`, `deadline`, `location`, `capacity`, `number`) VALUES
(20170001, '英语四级', '2017.03.21', '2017.06.05', '地大', 5000, 1),
(20170002, '英语六级', '2017.03.21', '2017.06.05', '地大', 5000, 1),
(20170003, '高等数学A1', '2017.02.03', '2017.02.15', '教三楼', 200, 0),
(20170004, '高等数学A2', '2017.02.03', '2017.02.15', '教三楼', 200, 0),
(20170005, '大学物理A', '2017.01.03', '2017.01.25', '地大教一楼', 500, 0),
(20170006, '大学物理B', '2017.01.03', '2017.01.25', '地大教一楼', 500, 0),
(20170007, '普通话等级考试', '2017.03.12', '2017.04.15', '地大北综', 5000, 0),
(20170008, '软件工程师等级考试', '2016.12.13', '2017.03.15', '华师', 2000, 0),
(20170009, '网络工程师等级考试', '2016.12.15', '2017.01.29', '华科', 2000, 0),
(20170010, '大学英语1', '2017.04.06', '2017.04.25', '地大北综', 100, 0),
(20170011, '大学英语2', '2017.02.03', '2017.03.01', '地大北综', 200, 0),
(20170012, '大学英语3', '2017.05.02', '2017.06.01', '地大北综', 200, 0),
(20170013, '大学英语4', '2017.02.04', '2017.03.02', '地大教三楼', 200, 0),
(20170014, '操作系统', '2017.02.01', '2017.02.09', '地大教三楼', 200, 0),
(20170015, '数据结构', '2017.05.06', '2017.05.15', '地大教一楼', 200, 0),
(20170016, '计算机组成与设计', '2017.01.02', '2017.09.02', '地大北综', 200, 0),
(20170017, '计算机组成原理', '2017.02.03', '2017.06.05', '地大教三楼', 566, 0),
(20170018, '计算机网络', '2017.05.06', '2017.06.08', '地大教一楼', 300, 0),
(20170019, '算法导论', '2017.02.01', '2017.03.02', '地大教二楼', 200, 0),
(20170020, 'PS', '2017.02.28', '2017.03.09', '地大北综', 200, 0),
(20170021, '路由与交换', '2017.05.06', '2017.06.05', '地大北综', 200, 0),
(20170022, 'C语言', '2017.06.02', '2017.06.03', '地大教二楼', 100, 0),
(20170023, 'C++程序设计', '2017.06.03', '2017.07.01', '地大北综', 200, 0),
(20170024, 'JAVA程序设计', '2017.06.08', '2017.07.02', '地大教三楼', 200, 0);

-- --------------------------------------------------------

--
-- 表的结构 `info`
--

CREATE TABLE `info` (
  `id` int(5) NOT NULL,
  `info` text CHARACTER SET utf8 COLLATE utf8_bin
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `info`
--

INSERT INTO `info` (`id`, `info`) VALUES
(0, '1.请点击左侧的添加考生来填写并提交\n\n2.最近考试安排如下\n\n\n英语四六级考试：2017年6月17日'),
(1, '1.最近考试安排如下\n\n英语四六级考试：2017年6月17日');

-- --------------------------------------------------------

--
-- 表的结构 `student`
--

CREATE TABLE `student` (
  `id` bigint(32) NOT NULL COMMENT '考生号',
  `password` varchar(50) DEFAULT NULL,
  `name` varchar(50) DEFAULT NULL,
  `credit_card` varchar(200) DEFAULT NULL COMMENT '身份证号',
  `sex` varchar(5) NOT NULL COMMENT '性别',
  `phone` bigint(32) DEFAULT NULL COMMENT '手机号',
  `local` varchar(200) DEFAULT NULL COMMENT '所在地'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `student`
--

INSERT INTO `student` (`id`, `password`, `name`, `credit_card`, `sex`, `phone`, `local`) VALUES
(20171003152, '14e1b600b1fd579f47433b88e8d85291', 'Xuan', '326515199420158951', '男', 13526552651, '湖北'),
(20151003188, '14e1b600b1fd579f47433b88e8d85291', 'Henry', '151131864789645161458456', '男', 1552625626, '湖北'),
(20151003198, '14e1b600b1fd579f47433b88e8d85291', '丽丽', '26262631562262633', '男', 152841552615, '北京'),
(20151003145, '14e1b600b1fd579f47433b88e8d85291', '李军', '896486555455155625', '男', 15266263515, '北京'),
(20151005621, '14e1b600b1fd579f47433b88e8d85291', '小米', '8964865559864165145', '女', 165165262633, '上海'),
(20151004587, '14e1b600b1fd579f47433b88e8d85291', '张丽', '896486555962232035', '女', 155962659448, '北京'),
(20151009625, '14e1b600b1fd579f47433b88e8d85291', '冰儿', '89648655544865413153', '女', 135689162623, '台北'),
(20151003486, '14e1b600b1fd579f47433b88e8d85291', '袁露', '8964865555625636565', '女', 147852626563, '香港'),
(20151007898, '14e1b600b1fd579f47433b88e8d85291', '张鑫', '896486555468465313535', '男', 1486223256555, '兰州'),
(20151008963, '14e1b600b1fd579f47433b88e8d85291', '张涵', '896896468516546665', '女', 15235965262, '长沙'),
(20151003565, '14e1b600b1fd579f47433b88e8d85291', '简单', '8964748946526313523', '男', 15246652332, '新余'),
(20151098754, '14e1b600b1fd579f47433b88e8d85291', '李艾', '896486555452665623', '女', 65165115316253, '武汉'),
(20151007458, '14e1b600b1fd579f47433b88e8d85291', '赵莉', '896486548651314685', '女', 123584662, '北京'),
(20151003999, '14e1b600b1fd579f47433b88e8d85291', '建梅', '8964865554565846513', '女', 1336526266, '贵阳'),
(20151000121, '14e1b600b1fd579f47433b88e8d85291', '许攸', '896486555465415616684', '男', 1563268645135, '成都'),
(20151047896, '14e1b600b1fd579f47433b88e8d85291', '韩寒', '896486515613020', '男', 96126526592563265, '上海'),
(20151007878, '14e1b600b1fd579f47433b88e8d85291', '姬发', '896486555896451+652+9', '男', 1512323586323, '上海'),
(20151001234, '14e1b600b1fd579f47433b88e8d85291', '妲己', '896486555496841514+6', '女', 89651648965156, '沈阳'),
(20151006999, ' 14e1b600b1fd579f47433b88e8d85291', '惠景', '89648655545265486', '女', 152315623, '天津'),
(20148964123, '14e1b600b1fd579f47433b88e8d85291', '静静', '896496549865156894651', '女', 165135326232652, '海口'),
(21478963321, '14e1b600b1fd579f47433b88e8d85291', '海华', '+9562356+86+34689168', '男', 6846568653256, '重启'),
(20148799556, '14e1b600b1fd579f47433b88e8d85291', '高管', '875457152158694168', '男', 56810636685320156, '北京'),
(54121213125, '14e1b600b1fd579f47433b88e8d85291', '李晶', '658168945189451468', '女', 15646894685156465, '沈阳'),
(25456489789, '14e1b600b1fd579f47433b88e8d85291', '顾局', '87694165168941', '男', 689416589415315648, '深圳');

-- --------------------------------------------------------

--
-- 表的结构 `student_exam`
--

CREATE TABLE `student_exam` (
  `id` bigint(32) NOT NULL COMMENT '考生号',
  `exam_id` int(8) DEFAULT NULL COMMENT '考试编号'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `student_exam`
--

INSERT INTO `student_exam` (`id`, `exam_id`) VALUES
(20171003152, 20170001),
(20151003188, 20170002);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin_core`
--
ALTER TABLE `admin_core`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `exam`
--
ALTER TABLE `exam`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `info`
--
ALTER TABLE `info`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
